config/betamocks/cache/mvi/profile/796127677.yml

---
:method: :post
:body: <env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header/><env:Body><idm:PRPA_IN201306UV02
  xmlns="urn:hl7-org:v3" xmlns:idm="http://vaww.oed.oit.va.gov" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"><id
  extension="WSDOC1709080106259220753388968" root="2.16.840.1.113883.4.349"/><creationTime
  value="20170908010626"/><versionCode code="3.0"/><interactionId extension="PRPA_IN201306UV02"
  root="2.16.840.1.113883.1.6"/><processingCode code="T"/><processingModeCode code="T"/><acceptAckCode
  code="NE"/><receiver typeCode="RCV"><device determinerCode="INSTANCE" classCode="DEV"><id
  extension="200VGOV" root="2.16.840.1.113883.4.349"/></device></receiver><sender
  typeCode="SND"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200M"
  root="2.16.840.1.113883.4.349"/></device></sender><acknowledgement><typeCode code="AA"/><targetMessage><id
  extension="200VGOV-00ab122f-6277-42d2-94cc-9b2a01f4ddc9" root="1.2.840.114350.1.13.0.1.7.1.1"/></targetMessage><acknowledgementDetail><code
  codeSystemName="MVI" code="132" displayName="IMT"/><text>Identity Match Threshold</text></acknowledgementDetail><acknowledgementDetail><code
  codeSystemName="MVI" code="120" displayName="PDT"/><text>Potential Duplicate Threshold</text></acknowledgementDetail></acknowledgement><controlActProcess
  classCode="CACT" moodCode="EVN"><code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/><subject
  typeCode="SUBJ"><registrationEvent classCode="REG" moodCode="EVN"><id nullFlavor="NA"/><statusCode
  code="active"/><subject1 typeCode="SBJ"><patient classCode="PAT"><id extension="1008710092V112476^NI^200M^USVHA^P"
  root="2.16.840.1.113883.4.349"/><id extension="1005396162^NI^200DOD^USDOD^A" root="2.16.840.1.113883.3.42.10001.100001.12"/><id
  extension="0000028024^PN^200PROV^USDVA^A" root="2.16.840.1.113883.4.349"/><id extension="32317886^PI^200CORP^USVBA^A"
  root="2.16.840.1.113883.4.349"/><id extension="0000001008710092V112476000000^PI^200ESR^USVHA^A"
  root="2.16.840.1.113883.4.349"/><id extension="0000001008596413V538566000000^PI^200ESR^USVHA^H"
  root="2.16.840.1.113883.4.349"/><id extension="1311140412049810941009014^PI^200SSA^USSSA^A"
  root="2.16.840.1.113883.4.1"/><id extension="796127677^PI^200BRLS^USVBA^A" root="2.16.840.1.113883.4.349"/><id
  extension="9100790897^PI^200CORP^USVBA^A" root="2.16.840.1.113883.4.349"/><statusCode
  code="active"/><patientPerson><name use="L"><given>JANET</given><given>L</given><family>MOORE</family></name><telecom
  value="(605)691-1682" use="HP"/><administrativeGenderCode code="F"/><birthTime value="19490506"/><addr
  use="PHYS"><streetAddressLine>26455 PARADISE VALLE</streetAddressLine><city>WARNER
  SPRINGS</city><state>CA</state><postalCode>92086</postalCode><country>USA</country></addr><asOtherIDs
  classCode="SSN"><id extension="796127677" root="2.16.840.1.113883.4.1"/><scopingOrganization
  determinerCode="INSTANCE" classCode="ORG"><id root="1.2.840.114350.1.13.99997.2.3412"/></scopingOrganization></asOtherIDs></patientPerson><subjectOf1><queryMatchObservation
  classCode="COND" moodCode="EVN"><code code="IHE_PDQ"/><value value="169" xsi:type="INT"/></queryMatchObservation></subjectOf1></patient></subject1><custodian
  typeCode="CST"><assignedEntity classCode="ASSIGNED"><id root="2.16.840.1.113883.4.349"/></assignedEntity></custodian></registrationEvent></subject><queryAck><queryId
  extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><queryResponseCode code="OK"/><resultCurrentQuantity
  value="1"/></queryAck><queryByParameter><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><statusCode
  code="new"/><modifyCode code="MVI.COMP1"/><initialQuantity value="1"/><parameterList><livingSubjectAdministrativeGender><value
  code="F"/><semanticsText>Gender</semanticsText></livingSubjectAdministrativeGender><livingSubjectBirthTime><value
  value="19490506"/><semanticsText>Date of Birth</semanticsText></livingSubjectBirthTime><livingSubjectId><value
  extension="796127677" root="2.16.840.1.113883.4.1"/><semanticsText>SSN</semanticsText></livingSubjectId><livingSubjectName><value
  use="L"><given>JANET</given><given>L</given><family>MOORE</family></value><semanticsText>Legal
  Name</semanticsText></livingSubjectName></parameterList></queryByParameter></controlActProcess></idm:PRPA_IN201306UV02></env:Body></env:Envelope>
:headers:
  connection: close
  date: Fri, 08 Sep 2017 06:06:25 GMT
  content-length: '4597'
  content-type: text/xml
  set-cookie: JSESSIONID=Gh50ZyzBkjxnNt1gnDSGTJ1hgkSB8MbWGhKBbFJPrJnKtYmLlMbq!544686593;
    path=/; HttpOnly
  x-powered-by: Servlet/2.5 JSP/2.1
:status: 200
